# 1. Дано ціле число (int). Порахувати скільки нулів в цьому числі.

my_int = 1805603801
my_number = "0"
count = str(my_int).count(my_number)
print(count)
#####################################################

# 2. Дано ціле число (int).
# Порахувати скільки нулів в кінці цього числа. Наприклад для числа 1002000 - три нулі

my_int = 1805603800
count = 0
reversed_str = str(my_int)[::-1]
for number in reversed_str:
    if number == "0":
       count += 1
    else:
        break
print(count)
#####################################################

# 3. Дан список my_list. СТВОРИТИ НОВИЙ список new_list у якого перший элемент з my_list
# стоїть на останньому месці в new_list. Якщо my_list [1,2,3,4], то new_list [2,3,4,1]

my_list = [1,2,3,4]
new_list = my_list[1:] + my_list[:1]
print(new_list)
#####################################################

# 4. Дана строка в якій є числа (разділяються пробілами).
# Наприклад "43 більше за 34, але меньше за 56". Знайти суму ВСІХ ЧИСЕЛ (А НЕ ЦИФР) в цій строкі.
# Для даного прикладу відповідь - 133. (використайте split и перевірку isdigit)

my_str = "43 більше за 34, але меньше за 56"
new_str = my_str.replace(",", "").split(" ")
result = 0
for number in new_str:
    if number.isdigit():
       result += int(number)
print(result)
#####################################################

# 5. Дана строка my_str. Разділіть цю строку на пари з двох символів и поместіть ці пари в список.
# Якщо строка має непарну кількість символів, останній символ останньої пари має
# бути підкресленням ('_'). Приклади: 'abcd' -> ['ab', 'cd'], 'abcde' -> ['ab', 'cd', e_']
# (використовуйте зрізи довжиною 2 символи)

my_str = "abcde"
result = []
for idx in range(0, len(my_str), 2):
    pair = my_str[idx:idx+2]
    if len(pair) == 1:
        pair += '_'
    result.append(pair)
print(result)
#####################################################

# 6. Дан список чисел. Порахуйте, скільки в цьому списку елементів,
# які більше за суму двох своїх сусідів (зліва и справа), и НАДРУКУЙТЕ КІЛЬКІСТЬ таких елементів.
# Крайні елементи списку не враховувати, оскільки в них недостньо сусідів.
# Для списка [2,4,1,5,3,9,0,7] відповіддю буде 3, тому що 4 > 2+1, 5 > 1+3, 9>3+0.

my_list = [2,4,1,5,3,9,0,7]
count = 0
for idx in range(1, len(my_list)-1):
    if my_list[idx] > my_list[idx-1] + my_list[idx+1]:
       count += 1
print(count)